CSI API ETABS v1

# cDCompColEurocode_4_2004SetPreference Method

---

Sets the value of a composite column design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDCompColEurocode_4_2004
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 24, inclusive, indicating the preference item
considered.

  1. Multi-response case design
  2. Country
  3. Combos equation
  4. Reliability class
  5. Framing type
  6. Consider second-order moments
  7. Partial factor for steel, GammaS
  8. Partial factor for concrete, GammaC
  9. Partial factor for modulus of elasticity of concrete, GammaCE
  10. AlphaCC
  11. AlphaCT
  12. Ignore seismic code
  13. Pattern live load factor
  14. Demand/capacity ratio limit

Value

    Type: SystemDouble
The numeric value of the considered preference item.

  1. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by step
     * 3 = Last step
     * 4 = Envelopes - All
     * 5 = Step-by step - All
  2. Country
     * 1 = CEN Default
     * 2 = United Kingdom
     * 3 = Slovenia
     * 4 = Bulgaria
     * 5 = Norway
     * 6 = Singapore
     * 7 = Sweden
     * 8 = Finland
     * 9 = Denmark
     * 10 = Portugal
     * 11 = Germany
     * 12 = Poland
     * 13 = Ireland
  3. Combos equation
     * 1 = Eq. 6.10
     * 2 = Max of Eqs. 6.10a and 6.10b
  4. Reliability class
     * 1 = Class 1
     * 2 = Class 2
     * 3 = Class 3
  5. Framing type
     * 1 = DCH-MRF (Ductility Class High - Moment Frame)
     * 2 = DCM-MRF (Ductility Class Medium - Moment Frame)
     * 3 = DCL-MRF (Ductility Class Low - Moment Frame)
     * 4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
     * 5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
     * 6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
     * 7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
     * 8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
     * 9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
     * 10 = Inverted Pendulum Structure
     * 11 = Secondary
  6. Consider second-order moments

0 = No

Any other value = Yes

  7. Partial factor for steel, GammaS

Value > 0

  8. Partial factor for concrete, GammaC

Value > 0

  9. Partial factor for modulus of elasticity of concrete, GammaCE

Value > 0

  10. AlphaCC

Value > 0

  11. AlphaCT

Value > 0

  12. Ignore seismic code

0 = No

Any other value = Yes

  13. Pattern live load factor

Value > 0

  14. Demand/capacity ratio limit

Value > 0

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set composite column design code
       ret = SapModel.DesignCompositeColumn.SetCode("Eurocode 4-2004")

    'set overwrite item
       ret = SapModel.DesignCompositeColumn.Eurocode_4_2004.SetPreference(2, 1)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCompColEurocode_4_2004 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com